{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 5505, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 6, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 45, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 19, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "embedding_11", "class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 11, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "embedding_12", "class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 134, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 3064, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 202, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "embedding_15", "class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, 201], "dtype": "float32", "input_dim": 202, "output_dim": 250, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 201}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["embedding_7", 0, 0, {}], ["embedding_8", 0, 0, {}], ["embedding_9", 0, 0, {}], ["embedding_10", 0, 0, {}], ["embedding_11", 0, 0, {}], ["embedding_12", 0, 0, {}], ["embedding_13", 0, 0, {}], ["embedding_14", 0, 0, {}], ["embedding_15", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 250, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.1, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0], ["input_10", 0, 0], ["input_11", 0, 0], ["input_12", 0, 0], ["input_13", 0, 0], ["input_14", 0, 0], ["input_15", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.3.0", "backend": "tensorflow"}